# SubDivisionPhaseMismatch Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SubRegionFailures..::..SubDivisionPhaseMismatch Property
BuiltInFailures..::..SubRegionFailures Class See Also
---
Sub-division must have the same Phase Created parameter and Phase Demolished parameter as the host Toposolid. Sub-division phase will be set to match the Toposolid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SubDivisionPhaseMismatch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SubDivisionPhaseMismatch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SubDivisionPhaseMismatch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SubRegionFailures Class
Autodesk.Revit.DB Namespace